{
    "id": "Ex71hEqRbqg",
    "title": "The Village of Five Poles: Learn English (US) with subtitles - Story for Children \"BookBox.Com\"",
    "description": "After the Electricity Department installs five electricity poles in their village, the villagers are excited. But when the Electricity Department doesn't return to finish the work, the village is left with five empty poles. What will they do?\n\nGet our FREE App for Android: https://bit.ly/2oAUev9 and for iOS: https://apple.co/2Isv5th\n\nSubscribe for new videos every week!: https://www.youtube.com/user/bookboxinc/?sub_confirmation=1\nMore English (IND) AniBooks: https://www.youtube.com/playlist?list=PLPDzF0B97OtG-C041UdZQQ56m4HG3Be08\nSimilar AniBooks: https://www.youtube.com/playlist?list=PLPDzF0B97OtEeRnUF6yAztaTI9yt8Pyb6\n\nThe Village of Five Poles\n\nOne day, in a sleepy village with no electricity, the Electricity Department decided to put up electricity poles. \n\nThe villagers were excited. Every day, a big pit was dug out for each pole. The entire village would gather and watch.\n\nRopes were used to pull up the poles. The villagers helped lift the poles into the pits.\nEven the kids pulled the ropes with all their might. \"HAYYIIISHHHHAAAAAA!\" \n\nOnce the poles were up, the Electricity Department team vanished.\n\nEvery day, the villagers would wait for them to come back and finish their work. All they could talk about was how excited they were to get electricity.\n\nThe villagers began climbing up the poles. The poles gave them a perfect view of their surroundings and far away villages. Days passed, with no sign of the Electricity Department team. One evening, a little child took a lantern from her house.\n\nShe climbed up one of the poles and hung the lantern on top. Everyone noticed the lovely bright lantern on top of the pole. The next evening, the villagers hung lanterns from all five poles.\n\nEvery day, lanterns were taken down, refueled, and hung back up again. The villagers made a game of it and had lots of fun. Then, even without electricity, the nearby villages could spot this little village from afar at night.\n\nThey began calling it ‘The Village of Five Poles.’\n\nAuthor: Mukesh Malviya\nIllustrations: Proiti Roy\nMusic: Rajesh Gilbert\nTranslation: Sanjana Khoobchandani\nNarration: Jaimeen Dalia\nAnimation: BookBox\n\nWEBSITE: http://www.bookbox.com\nFACEBOOK: https://www.facebook.com/BookBoxInc/\nINSTAGRAM: https://www.instagram.com/bookboxinc/\nTWITTER: https://twitter.com/bookboxInc\n\n#BookBox #BookBoxEnglish #Learn2Read",
    "duration": 194,
    "channel": "bookboxinc",
    "uploader": "bookboxinc",
    "upload_date": "20210509",
    "view_count": 23128,
    "like_count": 488,
    "tags": [
        "Children stories in English US",
        "readalong",
        "animation",
        "bookbox",
        "children",
        "kids",
        "language",
        "learn",
        "read",
        "stories",
        "captions",
        "subtitles",
        "cartoon",
        "fun",
        "lessons",
        "tutorial",
        "audio",
        "books",
        "parents",
        "school",
        "family",
        "teacher",
        "education",
        "reading",
        "student",
        "friends",
        "Electricity",
        "Light"
    ],
    "language": "en",
    "webpage_url": "https://www.youtube.com/watch?v=Ex71hEqRbqg"
}