{
    "id": "Pau7-q1gvzg",
    "title": "Just the Way I Am: Learn English (US) with subtitles - Story for Children and Adults \"BookBox.Com\"",
    "description": "Matko is too wide to fit through the yard-gate. Her friends suggest different exercises to help her slim down, but nothing works. Finally, Matko comes up with her own way to fit in.\n\nGet our FREE App for Android: https://bit.ly/2oAUev9 and for iOS: https://apple.co/2Isv5th\n\nSubscribe for new videos every week!: https://www.youtube.com/user/bookboxinc/?sub_confirmation=1\nMore English (US) AniBooks: https://www.youtube.com/playlist?list=PL1ECF842014D455FD\nSimilar AniBooks: https://www.youtube.com/watch?v=Ex71hEqRbqg\n\nJust the Way I Am\nAuthor: Bindu Gupta\nIllustrator: Kanak Shashi\n\nA herd of sheep was coming back home in the evening, happy as usual. Except for Matko. She was too wide to fit through the new farm gate.\nShe had been sleeping outside for over a week. \nThat darn gate!  It wasn't fair.\nThe yogi sheep said, “Do yoga! Yoga will make you thinner. Then you will fit through the gate.”\nThe next day, Matko started doing yoga. \nMany days passed… But Matko was still too wide to fit through the gate.\nThe jogger sheep suggested, “Start jogging! Jogging will make you thinner. Then you will fit through the gate.”\nSo Matko went for a jog every day.\nDays passed, but she was still too wide for the gate.  \nThe swimmer sheep advised, “Start swimming! Swimming will make you thinner. Then you will fit through the gate.”\nSo Matko began swimming...\nBut she was still too wide to fit through the gate!\nBunni came by showing off her bicycle. \n“Start cycling, Matko. Cycling will make you thinner. If cycling doesn't help you fit through the gate, I'll eat my hat!”\nMatko was upset. “Enough now! I just want to go home.\"\nSo she thought and thought. And then she set off. \nA few days later, Matko returned. Now she had a plan. She had...TOOLS!\nThe next morning, Matko woke up in her favourite place. All the other sheep were astonished. “But you're still so wide!\" they bleated. \"How did you get inside the yard?\"\n“I simply made the gate a little wider,\" Matko replied with a grin. \"I am fit, and I am fine...just the way I am!”\n\nAuthor: Bindu Gupta\nIllustrator: Kanak Shashi\nTranslator: Alisha Berger\nMusic: Rajesh Gilbert\nNarration: Tamar Gaffin-Cahn\nAnimation: BookBox\n\nWEBSITE: http://www.bookbox.com\nFACEBOOK: https://www.facebook.com/BookBoxInc/\nINSTAGRAM: https://www.instagram.com/bookboxinc/\nTWITTER: https://twitter.com/bookboxInc\n\n#BookBox #BookBoxEnglish #Learn2Read",
    "duration": 253,
    "channel": "bookboxinc",
    "uploader": "bookboxinc",
    "upload_date": "20210628",
    "view_count": 40371,
    "like_count": 697,
    "tags": [
        "Children stories in English",
        "readalong",
        "animation",
        "bookbox",
        "children",
        "kids",
        "language",
        "learn",
        "read",
        "stories",
        "captions",
        "subtitles",
        "cartoon",
        "fun",
        "lessons",
        "tutorial",
        "audio",
        "books",
        "parents",
        "school",
        "family",
        "teacher",
        "education",
        "reading",
        "student",
        "save earth",
        "forest",
        "Indian English",
        "sheep",
        "fitness",
        "yoga",
        "motivation",
        "farm",
        "yard"
    ],
    "language": "en",
    "webpage_url": "https://www.youtube.com/watch?v=Pau7-q1gvzg"
}