{
    "id": "PB3_Ky9lP-E",
    "title": "Kanchha, the Rhino: Learn English (US) with subtitles - Story for Children and Adults \"BookBox.Com\"",
    "description": "This is the story of a little rhino who lives in a big grassland. He loves to explore, but one day he strays too far from his mother and gets lost. Read on to find out how he gets out of trouble.\n\nGet our FREE App for Android: https://bit.ly/2oAUev9 and for iOS: https://apple.co/2Isv5th\n\nSubscribe for new videos every week!: https://www.youtube.com/user/bookboxinc/?sub_confirmation=1\nMore English (US) AniBooks: https://www.youtube.com/playlist?list=PL1ECF842014D455FD\nSimilar AniBooks: https://youtu.be/BmqZ2y6VAVY\n\nKanchha, the Rhino\nIn a vast grassland, there lived a little rhino named Kanchha. \nKanchha was two years old and lived with his mother. \nHe loved to wander about the grassland.\nHis mother would often warn him, “Kanchha, there are a lot of bad things out there. Be careful, son. Always remember to leave your scent so that you can smell your way back home.” \nKanchha understood, but it was hard for him to remember everything.\nOne afternoon, Kanchha was taking a mud bath.\nSuddenly, he heard a strange noise. \nHe jumped up from the mud and walked closer to the sound. He looked around and realized that he had walked much farther than he thought. He remembered his mother’s words and turned around to walk back home.\nThen, he heard the same sound again. He saw a giant python sliding towards him and it filled him with fear! He ran and hid behind the tall grasses.\nHe was very scared. He closed his eyes tightly and stayed very still. Kanchha carefully peeked through the tall grasses. He saw the python swallowing a deer. \nHe breathed a sigh of relief.\nIt was getting dark and Kanchha knew it was time to go home. He turned around. \nHe tried to find his scent, but he couldn't smell it anywhere.\nHe ran round and round, but couldn't make out which direction he had come from. He remembered his mother’s words and began to cry.\n“Kanchha…! Kanchha…!” he heard someone calling his name. He jumped with joy and ran as fast as he could.\nTHUMP! Kanchha landed in a pit. \n“Kanchha…! Kanchha…!” He heard his mother calling from above the pit. “I’m sorry for going too far, Ma!” said Kanchha sadly.\n “Don’t worry son, I’ll go get some help,” she promised him.\nThe next morning, Kanchha woke up to find himself tied up with ropes. He could hear noises all around him. Kanchha was confused. \nHe tried to struggle free, but it only hurt so he stopped. After a while he felt himself being lifted. “Have I been captured?” he thought.\nHe found himself on the ground again. He heard all sorts of strange sounds. “Hurrah! Woohoo!” He could hear claps and whistles. There were hundreds of humans around him. They held up posters with a rhino’s photograph. \nAs he got closer they were all smiling at him, but he recognized no one. \nHe was scared. “Who are they? Why are they here? What are they going to do to me?” he thought.\nOne of the humans came towards him and touched him gently. Slowly, he turned Kanchha’s head towards the jungle.\nKanchha saw his mother waiting for him behind the trees. These humans had not captured him, they had saved him!\nKanchha ran as fast as he could to his mother. He was safe again. He would never wander so far without leaving his scent ever again.\n\nAuthor: Shilpi Pradhan\nIllustrations: Abin Shrestha\nMusic: Rajesh Gilbert\nTranslation: Shannon David\nNarration: Tamar Gaffin-Cahn\nAnimation: BookBox\n\nWEBSITE: http://www.bookbox.com\nFACEBOOK: https://www.facebook.com/BookBoxInc/\nINSTAGRAM: https://www.instagram.com/bookboxinc/\nTWITTER: https://twitter.com/bookboxInc\n\n#BookBox #BookBoxEnglish #Learn2Read",
    "duration": 361,
    "channel": "bookboxinc",
    "uploader": "bookboxinc",
    "upload_date": "20210606",
    "view_count": 20915,
    "like_count": 307,
    "tags": [
        "Children stories in English",
        "readalong",
        "animation",
        "bookbox",
        "children",
        "kids",
        "language",
        "learn",
        "read",
        "stories",
        "captions",
        "subtitles",
        "cartoon",
        "fun",
        "lessons",
        "tutorial",
        "audio",
        "books",
        "parents",
        "school",
        "family",
        "teacher",
        "education",
        "reading",
        "student",
        "rhino",
        "animals",
        "save earth",
        "save rhino",
        "forest",
        "Indian English"
    ],
    "language": "en",
    "webpage_url": "https://www.youtube.com/watch?v=PB3_Ky9lP-E"
}